// [PGS] 최소직사각형 / leve1
// 난이도 :  level 1
// 풀이시간 : 
// 점수 : +1

/*
문제
명함 지갑을 만드는 회사에서 지갑의 크기를 정하려고 합니다. 다양한 모양과 크기의 명함들을 모두 수납할 수 있으면서, 작아서 들고 다니기 편한 지갑을 만들어야 합니다. 이러한 요건을 만족하는 지갑을 만들기 위해 디자인팀은 모든 명함의 가로 길이와 세로 길이를 조사했습니다.

아래 표는 4가지 명함의 가로 길이와 세로 길이를 나타냅니다.

명함 번호	가로 길이	세로 길이
1	60	50
2	30	70
3	60	30
4	80	40
가장 긴 가로 길이와 세로 길이가 각각 80, 70이기 때문에 80(가로) x 70(세로) 크기의 지갑을 만들면 모든 명함들을 수납할 수 있습니다. 하지만 2번 명함을 가로로 눕혀 수납한다면 80(가로) x 50(세로) 크기의 지갑으로 모든 명함들을 수납할 수 있습니다. 이때의 지갑 크기는 4000(=80 x 50)입니다.

모든 명함의 가로 길이와 세로 길이를 나타내는 2차원 배열 sizes가 매개변수로 주어집니다. 모든 명함을 수납할 수 있는 가장 작은 지갑을 만들 때, 지갑의 크기를 return 하도록 solution 함수를 완성해주세요.

제한사항
sizes의 길이는 1 이상 10,000 이하입니다.
sizes의 원소는 [w, h] 형식입니다.
w는 명함의 가로 길이를 나타냅니다.
h는 명함의 세로 길이를 나타냅니다.
w와 h는 1 이상 1,000 이하인 자연수입니다.
입출력 예
sizes	result
[[60, 50], [30, 70], [60, 30], [80, 40]]	4000
[[10, 7], [12, 3], [8, 15], [14, 7], [5, 15]]	120
[[14, 4], [19, 6], [6, 16], [18, 7], [7, 11]]	133
입출력 예 설명
입출력 예 #1
문제 예시와 같습니다.

입출력 예 #2
명함들을 적절히 회전시켜 겹쳤을 때, 3번째 명함(가로: 8, 세로: 15)이 다른 모든 명함보다 크기가 큽니다. 따라서 지갑의 크기는 3번째 명함의 크기와 같으며, 120(=8 x 15)을 return 합니다.

입출력 예 #3
명함들을 적절히 회전시켜 겹쳤을 때, 모든 명함을 포함하는 가장 작은 지갑의 크기는 133(=19 x 7)입니다.
*/

/*
< 의사코드 >
w가 h보다 작으면 두개를 바꿔서 w의 최대값을 구하고, h의 최대값을 구해서 곱한다.

1. 0번인덱스를 w로 ,1번 인덱스를 h로 선언하여 담는다다
2. sizes의 길이를 len으로 선언하여 담아둔다
3. for문으로 사이즈의 길이만큼 순회한다
4.
*/
let sizes = [[60, 50], [30, 70], [60, 30], [80, 40]]

function solution(sizes) {
  let [w, h] = [sizes.map(el => el[0]), sizes.map(el => el[1])]
//   w
// (4) [60, 30, 60, 80]
// h
// (4) [50, 70, 30, 40]
  let len = sizes.length;

  for (let i = 0; i < len; i++) {
    if (w[i] < h[i]) {
      let tmp = w[i];
      w[i] = h[i];
      h[i] = tmp;
    }
  };
  let [maxW, maxH] = [Math.max(...w), Math.max(...h)] 

  
  let answer = maxW * maxH;
  return answer;
}

/*
테스트 1 〉	통과 (0.12ms, 33.5MB)
테스트 2 〉	통과 (0.13ms, 33.4MB)
테스트 3 〉	통과 (0.12ms, 33.6MB)
테스트 4 〉	통과 (0.12ms, 33.5MB)
테스트 5 〉	통과 (0.14ms, 33.6MB)
테스트 6 〉	통과 (0.11ms, 33.6MB)
테스트 7 〉	통과 (0.13ms, 33.5MB)
테스트 8 〉	통과 (0.14ms, 33.6MB)
테스트 9 〉	통과 (0.18ms, 33.4MB)
테스트 10 〉	통과 (0.39ms, 33.5MB)
테스트 11 〉	통과 (0.39ms, 33.5MB)
테스트 12 〉	통과 (1.12ms, 33.5MB)
테스트 13 〉	통과 (0.58ms, 33.7MB)
테스트 14 〉	통과 (0.66ms, 33.8MB)
테스트 15 〉	통과 (0.99ms, 34MB)
테스트 16 〉	통과 (0.88ms, 34.5MB)
테스트 17 〉	통과 (1.40ms, 35MB)
테스트 18 〉	통과 (1.19ms, 35.4MB)
테스트 19 〉	통과 (1.69ms, 35.7MB)
테스트 20 〉	통과 (1.45ms, 35.7MB)
*/

